sreemagal/AIRBUS-TRAINING/DAY10_EXERCISES/SOFTWARE_FAULT_INJECTION_ DATA_CORRUPTION_API_FAILURES/Deterministic_sfi_campaign_evkb_imxrt_1050_adk_hi_8582_uart_reference_implementation.c
/*
 * Deterministic Software Fault Injection (SFI) Campaign
 * Target: EVKB-IMXRT1050 (MCUXpresso SDK 2.16.x style; see uploaded SDK_25_06_00_EVKB-IMXRT1050.zip)
 *
 * Base project to import in MCUXpresso IDE:
 *   boards/evkbimxrt1050/driver_examples/lpuart/interrupt_transfer/
 *
 * This canvas contains a complete, working reference implementation broken into files.
 * Copy each "File:" section into your MCUXpresso project.
 *
 * IMPORTANT HW NOTE:
 *   - Keep LPUART1 as the debug console (PRINTF / CLI).
 *   - Use a SECOND LPUART instance for the ADK/HI-8582 data UART (default below: LPUART3).
 *   - You MUST enable pin muxing for the chosen DATA LPUART pins using MCUXpresso Pins tool
 *     (or manually edit pin_mux.c) to match how you wired EVKB <-> ADK/HI-8582.
 *
 * Build flags:
 *   - Add SFI_ENABLED=1 to the preprocessor symbols (or set to 0 for a clean build).
 *
 * UART framing expected from ADK/HI-8582 -> EVKB:
 *   [0xA5][LEN=4][W0][W1][W2][W3][CHK]
 *   CHK := (LEN + W0 + W1 + W2 + W3) & 0xFF
 *
 * Data rate:
 *   - Keep traffic <= 115200 bps; recommended 50–200 frames/s for clean observation.
 */

/******************************************************************************
 * File: source/app.h  (REPLACE the example's app.h or merge the new macros)
 ******************************************************************************/
#ifndef _APP_H_
#define _APP_H_

/* Base example had DEMO_LPUART == LPUART1 for debug console.
 * Keep it that way for PRINTF + CLI.
 */
#define DEMO_LPUART          LPUART1
#define DEMO_LPUART_CLK_FREQ BOARD_DebugConsoleSrcFreq()

/* Data UART toward ADK/HI-8582 (choose any available LPUART you routed to pins).
 * Default: LPUART3.
 */
#define DATA_LPUART          LPUART3
#define DATA_LPUART_IRQn     LPUART3_IRQn
#define DATA_LPUART_IRQHandler LPUART3_IRQHandler
#define DATA_LPUART_CLK_FREQ BOARD_DebugConsoleSrcFreq()
#define DATA_LPUART_BAUDRATE (115200U)

/* PIT tick (10 ms) used for TX stall monitoring + periodic telemetry. */
#define DEMO_PIT_BASEADDR PIT
#define DEMO_PIT_CHANNEL  kPIT_Chnl_0
#define PIT_IRQ_ID        PIT_IRQn
#define PIT_IRQ_HANDLER   PIT_IRQHandler
#define PIT_SOURCE_CLOCK  CLOCK_GetFreq(kCLOCK_OscClk)

void BOARD_InitHardware(void);

#endif /* _APP_H_ */

/******************************************************************************
 * File: source/fi.h
 ******************************************************************************/
#ifndef FI_H
#define FI_H

#include <stdint.h>
#include <stdbool.h>

#ifndef SFI_ENABLED
#define SFI_ENABLED 1
#endif

typedef enum
{
    FI_SITE_RX_CORRUPT = 0,
    FI_SITE_A429_LABEL_TAMPER,
    FI_SITE_A429_PARITY_TAMPER,
    FI_SITE_TX_API_FAIL,
    FI_SITE_TX_STALL,

    FI_SITE_COUNT
} fi_site_t;

typedef enum
{
    FI_POLICY_DISABLED = 0,
    FI_POLICY_EVERY_N,
    FI_POLICY_WINDOW
} fi_policy_t;

typedef struct
{
    fi_policy_t policy;
    uint32_t every_n;        /* for EVERY_N */
    uint32_t window_start;   /* for WINDOW (inclusive) */
    uint32_t window_end;     /* for WINDOW (exclusive) */

    uint32_t hit_count;
    uint32_t fire_count;

    /* Optional parameters per site */
    uint8_t bits_to_flip;    /* RX_CORRUPT */
    uint8_t reserved;
    uint16_t reserved2;
} fi_site_cfg_t;

typedef struct
{
    uint32_t ts_ms;
    uint8_t site;
    uint8_t fired;
    uint16_t spare;
    uint32_t hit;
    uint32_t extra;
    uint32_t data_peek;
} fi_event_t;

void FI_Init(uint32_t seed);

/* Timebase hookup (ms). Call once from PIT ISR or your time source. */
void FI_SetNowMs(uint32_t now_ms);
uint32_t FI_NowMs(void);

/* Configuration */
fi_site_cfg_t *FI_SiteCfg(fi_site_t site);
void FI_DisableAll(void);

/* Decision */
bool FI_ShouldFire(fi_site_t site);

/* Helpers */
uint8_t FI_CorruptByteDeterministic(uint8_t in);
uint32_t FI_Rand32(void);

/* Logging */
void FI_Log(fi_site_t site, bool fired, uint32_t hit, uint32_t extra, uint32_t data_peek);
void FI_DumpLog(void (*emit)(const char *s));

#endif /* FI_H */

/******************************************************************************
 * File: source/fi.c
 ******************************************************************************/
#include "fi.h"

#if SFI_ENABLED

#ifndef FI_LOG_DEPTH
#define FI_LOG_DEPTH 128
#endif

static volatile uint32_t g_now_ms;
static fi_site_cfg_t g_sites[FI_SITE_COUNT];
static fi_event_t g_log[FI_LOG_DEPTH];
static volatile uint32_t g_log_wr;

static uint32_t g_rng;

static uint32_t xorshift32(uint32_t x)
{
    /* Deterministic and fast. */
    x ^= x << 13;
    x ^= x >> 17;
    x ^= x << 5;
    return x;
}

void FI_Init(uint32_t seed)
{
    g_now_ms = 0;
    g_rng = (seed == 0U) ? 0xA5A5A5A5U : seed;

    for (int i = 0; i < (int)FI_SITE_COUNT; i++)
    {
        g_sites[i].policy = FI_POLICY_DISABLED;
        g_sites[i].every_n = 0;
        g_sites[i].window_start = 0;
        g_sites[i].window_end = 0;
        g_sites[i].hit_count = 0;
        g_sites[i].fire_count = 0;
        g_sites[i].bits_to_flip = 1;
    }

    /* Default arming matching the exercise spec */
    g_sites[FI_SITE_RX_CORRUPT].policy = FI_POLICY_EVERY_N;
    g_sites[FI_SITE_RX_CORRUPT].every_n = 200;
    g_sites[FI_SITE_RX_CORRUPT].bits_to_flip = 3;

    g_sites[FI_SITE_TX_API_FAIL].policy = FI_POLICY_EVERY_N;
    g_sites[FI_SITE_TX_API_FAIL].every_n = 100;

    g_sites[FI_SITE_TX_STALL].policy = FI_POLICY_WINDOW;
    g_sites[FI_SITE_TX_STALL].window_start = 500;
    g_sites[FI_SITE_TX_STALL].window_end   = 520;

    /* Optional: you can arm label/parity tampers from CLI */
    g_sites[FI_SITE_A429_LABEL_TAMPER].policy = FI_POLICY_DISABLED;
    g_sites[FI_SITE_A429_PARITY_TAMPER].policy = FI_POLICY_DISABLED;

    g_log_wr = 0;
}

void FI_SetNowMs(uint32_t now_ms) { g_now_ms = now_ms; }
uint32_t FI_NowMs(void) { return g_now_ms; }

fi_site_cfg_t *FI_SiteCfg(fi_site_t site)
{
    if ((int)site < 0 || site >= FI_SITE_COUNT) return (fi_site_cfg_t *)0;
    return &g_sites[site];
}

void FI_DisableAll(void)
{
    for (int i = 0; i < (int)FI_SITE_COUNT; i++)
    {
        g_sites[i].policy = FI_POLICY_DISABLED;
    }
}

uint32_t FI_Rand32(void)
{
    g_rng = xorshift32(g_rng);
    return g_rng;
}

bool FI_ShouldFire(fi_site_t site)
{
    fi_site_cfg_t *cfg = FI_SiteCfg(site);
    if (!cfg) return false;

    cfg->hit_count++;

    bool fire = false;
    switch (cfg->policy)
    {
        case FI_POLICY_DISABLED:
            fire = false;
            break;
        case FI_POLICY_EVERY_N:
            fire = (cfg->every_n != 0U) && ((cfg->hit_count % cfg->every_n) == 0U);
            break;
        case FI_POLICY_WINDOW:
            fire = (cfg->hit_count >= cfg->window_start) && (cfg->hit_count < cfg->window_end);
            break;
        default:
            fire = false;
            break;
    }

    if (fire) cfg->fire_count++;
    return fire;
}

uint8_t FI_CorruptByteDeterministic(uint8_t in)
{
    /* Flip cfg->bits_to_flip bits deterministically based on RNG. */
    fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_RX_CORRUPT);
    uint8_t out = in;

    const uint8_t flips = (cfg && cfg->bits_to_flip) ? cfg->bits_to_flip : 1U;
    for (uint8_t i = 0; i < flips; i++)
    {
        uint32_t r = FI_Rand32();
        uint8_t bit = (uint8_t)(r & 0x7U);
        out ^= (uint8_t)(1U << bit);
    }
    return out;
}

