sreemagal/AIRBUS-TRAINING/DAY10_EXERCISES/SOFTWARE_FAULT_INJECTION_ DATA_CORRUPTION_API_FAILURES/Deterministic_sfi_campaign_evkb_imxrt_1050_adk_hi_8582_uart_reference_implementation.c
void FI_Log(fi_site_t site, bool fired, uint32_t hit, uint32_t extra, uint32_t data_peek)
{
    uint32_t idx = g_log_wr++;
    fi_event_t *e = &g_log[idx % FI_LOG_DEPTH];
    e->ts_ms = FI_NowMs();
    e->site = (uint8_t)site;
    e->fired = fired ? 1U : 0U;
    e->hit = hit;
    e->extra = extra;
    e->data_peek = data_peek;
}

static const char *site_name(fi_site_t s)
{
    switch (s)
    {
        case FI_SITE_RX_CORRUPT: return "RX_CORRUPT";
        case FI_SITE_A429_LABEL_TAMPER: return "A429_LABEL_TAMPER";
        case FI_SITE_A429_PARITY_TAMPER: return "A429_PARITY_TAMPER";
        case FI_SITE_TX_API_FAIL: return "TX_API_FAIL";
        case FI_SITE_TX_STALL: return "TX_STALL";
        default: return "?";
    }
}

void FI_DumpLog(void (*emit)(const char *s))
{
    /* Very small footprint dump; caller formats. */
    (void)emit;
    /* Implemented in main via PRINTF for convenience; keep this module RTOS-agnostic. */
}

#else /* SFI_ENABLED == 0 */

void FI_Init(uint32_t seed) { (void)seed; }
void FI_SetNowMs(uint32_t now_ms) { (void)now_ms; }
uint32_t FI_NowMs(void) { return 0; }
fi_site_cfg_t *FI_SiteCfg(fi_site_t site) { (void)site; return (fi_site_cfg_t *)0; }
void FI_DisableAll(void) {}
bool FI_ShouldFire(fi_site_t site) { (void)site; return false; }
uint8_t FI_CorruptByteDeterministic(uint8_t in) { return in; }
uint32_t FI_Rand32(void) { return 0; }
void FI_Log(fi_site_t site, bool fired, uint32_t hit, uint32_t extra, uint32_t data_peek)
{
    (void)site; (void)fired; (void)hit; (void)extra; (void)data_peek;
}
void FI_DumpLog(void (*emit)(const char *s)) { (void)emit; }

#endif

/******************************************************************************
 * File: source/a429_frame.h
 ******************************************************************************/
#ifndef A429_FRAME_H
#define A429_FRAME_H

#include <stdint.h>
#include <stdbool.h>

typedef enum
{
    A429_PARSE_NONE = 0,
    A429_PARSE_WORD_OK,
    A429_PARSE_BAD_CHK,
    A429_PARSE_BAD_LEN,
} a429_parse_result_t;

typedef struct
{
    /* Parser state */
    uint8_t st;
    uint8_t len;
    uint8_t payload[4];
    uint8_t pay_idx;
    uint8_t chk;

    /* Stats */
    uint32_t frames_ok;
    uint32_t frames_bad_chk;
    uint32_t frames_bad_len;

} a429_uart_parser_t;

void A429_ParserInit(a429_uart_parser_t *p);

a429_parse_result_t A429_ParserFeed(a429_uart_parser_t *p, uint8_t byte, uint32_t *out_word);

/* ARINC checks */
bool A429_CheckOddParity(uint32_t word);
uint8_t A429_Label(uint32_t word);

#endif /* A429_FRAME_H */

/******************************************************************************
 * File: source/a429_frame.c
 ******************************************************************************/
#include "a429_frame.h"

#define ST_WAIT_SYNC  0
#define ST_LEN        1
#define ST_PAYLOAD    2
#define ST_CHK        3

static uint8_t chk8(uint8_t len, const uint8_t payload[4])
{
    uint16_t s = (uint16_t)len;
    s = (uint16_t)(s + payload[0] + payload[1] + payload[2] + payload[3]);
    return (uint8_t)(s & 0xFFU);
}

void A429_ParserInit(a429_uart_parser_t *p)
{
    p->st = ST_WAIT_SYNC;
    p->len = 0;
    p->pay_idx = 0;
    p->chk = 0;
    p->frames_ok = 0;
    p->frames_bad_chk = 0;
    p->frames_bad_len = 0;
}

a429_parse_result_t A429_ParserFeed(a429_uart_parser_t *p, uint8_t byte, uint32_t *out_word)
{
    switch (p->st)
    {
        case ST_WAIT_SYNC:
            if (byte == 0xA5U)
            {
                p->st = ST_LEN;
            }
            break;

        case ST_LEN:
            p->len = byte;
            p->pay_idx = 0;
            if (p->len != 4U)
            {
                p->frames_bad_len++;
                p->st = ST_WAIT_SYNC;
                return A429_PARSE_BAD_LEN;
            }
            p->st = ST_PAYLOAD;
            break;

        case ST_PAYLOAD:
            p->payload[p->pay_idx++] = byte;
            if (p->pay_idx >= 4U)
            {
                p->st = ST_CHK;
            }
            break;

        case ST_CHK:
            p->chk = byte;
            {
                uint8_t exp = chk8(p->len, p->payload);
                if (exp != p->chk)
                {
                    p->frames_bad_chk++;
                    p->st = ST_WAIT_SYNC;
                    return A429_PARSE_BAD_CHK;
                }

                /* Assemble little-endian 32-bit word: W0=LSB. */
                uint32_t w = ((uint32_t)p->payload[0]) |
                             ((uint32_t)p->payload[1] << 8) |
                             ((uint32_t)p->payload[2] << 16) |
                             ((uint32_t)p->payload[3] << 24);
                *out_word = w;

                p->frames_ok++;
                p->st = ST_WAIT_SYNC;
                return A429_PARSE_WORD_OK;
            }

        default:
            p->st = ST_WAIT_SYNC;
            break;
    }

    return A429_PARSE_NONE;
}

static uint32_t popcount32(uint32_t x)
{
    /* Portable popcount */
    x = x - ((x >> 1U) & 0x55555555U);
    x = (x & 0x33333333U) + ((x >> 2U) & 0x33333333U);
    x = (x + (x >> 4U)) & 0x0F0F0F0FU;
    x = x + (x >> 8U);
    x = x + (x >> 16U);
    return x & 0x3FU;
}

bool A429_CheckOddParity(uint32_t word)
{
    /* Treat bit31 as the parity bit; odd parity across all 32 bits means popcount is odd. */
    return (popcount32(word) & 0x1U) == 1U;
}

uint8_t A429_Label(uint32_t word)
{
    /* Label in bits 0..7 if using little-endian assembly above. */
    return (uint8_t)(word & 0xFFU);
}

/******************************************************************************
 * File: source/data_uart.h
 ******************************************************************************/
#ifndef DATA_UART_H
#define DATA_UART_H

#include <stdint.h>
#include <stdbool.h>

#include "fsl_lpuart.h"
#include "fi.h"

typedef struct
{
    LPUART_Type *base;
    lpuart_handle_t handle;

    volatile bool rxOnGoing;
    volatile bool txOnGoing;
    volatile bool rxByteReady;

    uint8_t rxByte;

    /* TX stall simulation */
    volatile bool txStallActive;

