sreemagal/AIRBUS-TRAINING/DAY10_EXERCISES/SOFTWARE_FAULT_INJECTION_ DATA_CORRUPTION_API_FAILURES/Deterministic_sfi_campaign_evkb_imxrt_1050_adk_hi_8582_uart_reference_implementation.c
} data_uart_t;

void DataUart_Init(data_uart_t *u, LPUART_Type *base, uint32_t clkHz, uint32_t baud);

/* Non-blocking, 1-byte RX "pump" */
status_t DataUart_StartReceive1(data_uart_t *u);

/* TX wrapper that can inject API failure / stall */
status_t DataUart_SendNonBlocking_FI(data_uart_t *u, const uint8_t *data, size_t len);

/* Progress tracking for stall monitor */
status_t DataUart_GetSendCount(data_uart_t *u, uint32_t *count);
void DataUart_AbortSend(data_uart_t *u);

#endif /* DATA_UART_H */

/******************************************************************************
 * File: source/data_uart.c
 ******************************************************************************/
#include "data_uart.h"
#include "fsl_common.h"
#include "fsl_gpio.h"

static void DataUart_Callback(LPUART_Type *base, lpuart_handle_t *handle, status_t status, void *userData)
{
    (void)base;
    (void)handle;
    data_uart_t *u = (data_uart_t *)userData;

    if (status == kStatus_LPUART_RxIdle)
    {
        u->rxOnGoing = false;
        u->rxByteReady = true;
    }
    else if (status == kStatus_LPUART_TxIdle)
    {
#if SFI_ENABLED
        /* Simulate lost TX completion by refusing to clear txOnGoing for this transfer. */
        if (u->txStallActive)
        {
            /* Keep txOnGoing asserted; PIT monitor must recover. */
            return;
        }
#endif
        u->txOnGoing = false;
    }
    else
    {
        /* Ignore */
    }
}

void DataUart_Init(data_uart_t *u, LPUART_Type *base, uint32_t clkHz, uint32_t baud)
{
    lpuart_config_t cfg;

    u->base = base;
    u->rxOnGoing = false;
    u->txOnGoing = false;
    u->rxByteReady = false;
    u->rxByte = 0;
    u->txStallActive = false;

    LPUART_GetDefaultConfig(&cfg);
    cfg.baudRate_Bps = baud;
    cfg.enableTx = true;
    cfg.enableRx = true;

    LPUART_Init(base, &cfg, clkHz);
    LPUART_TransferCreateHandle(base, &u->handle, DataUart_Callback, (void *)u);

    /* Enable IRQ for this LPUART instance (user must ensure DATA_LPUART_IRQn matches base). */
    /* NOTE: If using multiple cores/RTOS, set NVIC priority appropriately. */
}

status_t DataUart_StartReceive1(data_uart_t *u)
{
    lpuart_transfer_t xfer;
    if (u->rxOnGoing) return kStatus_LPUART_RxBusy;

    xfer.data = &u->rxByte;
    xfer.dataSize = 1U;

    u->rxOnGoing = true;
    u->rxByteReady = false;

    return LPUART_TransferReceiveNonBlocking(u->base, &u->handle, &xfer, NULL);
}

status_t DataUart_SendNonBlocking_FI(data_uart_t *u, const uint8_t *data, size_t len)
{
    lpuart_transfer_t xfer;

    /* Inject API failure: return TxBusy without calling the driver. */
#if SFI_ENABLED
    {
        fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_TX_API_FAIL);
        bool fire = FI_ShouldFire(FI_SITE_TX_API_FAIL);
        if (cfg)
        {
            FI_Log(FI_SITE_TX_API_FAIL, fire, cfg->hit_count, (uint32_t)len, (uint32_t)(len ? data[0] : 0U));
        }
        if (fire)
        {
            return kStatus_LPUART_TxBusy;
        }
    }
#endif

#if SFI_ENABLED
    /* Inject TX stall (lost completion): arm a one-transfer stall when site is active. */
    {
        fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_TX_STALL);
        bool fire = FI_ShouldFire(FI_SITE_TX_STALL);
        if (cfg)
        {
            FI_Log(FI_SITE_TX_STALL, fire, cfg->hit_count, (uint32_t)len, (uint32_t)(len ? data[0] : 0U));
        }
        u->txStallActive = fire;
    }
#else
    u->txStallActive = false;
#endif

    xfer.data = (uint8_t *)(uintptr_t)data;
    xfer.dataSize = len;

    u->txOnGoing = true;
    return LPUART_TransferSendNonBlocking(u->base, &u->handle, &xfer);
}

status_t DataUart_GetSendCount(data_uart_t *u, uint32_t *count)
{
    return LPUART_TransferGetSendCount(u->base, &u->handle, count);
}

void DataUart_AbortSend(data_uart_t *u)
{
    LPUART_TransferAbortSend(u->base, &u->handle);
    u->txOnGoing = false;
    u->txStallActive = false;
}

/******************************************************************************
 * File: source/main.c  (REPLACE lpuart_interrupt_transfer.c with this main.c)
 ******************************************************************************/
#include <string.h>
#include <stdlib.h>

#include "board.h"
#include "app.h"
#include "fsl_debug_console.h"
#include "fsl_gpio.h"
#include "fsl_pit.h"

#include "fi.h"
#include "a429_frame.h"
#include "data_uart.h"

/* -------------------------------
 * User LED macros come from board.h in the imported example.
 * ------------------------------- */

/* -------------------------------
 * Simple ACK on data UART to exercise TX path
 * ------------------------------- */
#define ACK_SYNC 0xACU

typedef enum
{
    ACK_OK = 0,
    ACK_BAD_CHK = 1,
    ACK_BAD_PARITY = 2,
    ACK_BAD_PLAUS = 3,
    ACK_BAD_LEN = 4,
    ACK_TX_DROP = 5,
} ack_reason_t;

typedef struct
{
    uint8_t b[2];
    uint8_t len;
} ack_msg_t;

#define ACK_Q_DEPTH 32
static ack_msg_t g_ackQ[ACK_Q_DEPTH];
static volatile uint32_t g_ackWr = 0, g_ackRd = 0;

static bool AckQ_Push(ack_reason_t r)
{
    uint32_t wr = g_ackWr;
    uint32_t rd = g_ackRd;
    if ((wr - rd) >= ACK_Q_DEPTH)
    {
        return false;
    }

    ack_msg_t *m = &g_ackQ[wr % ACK_Q_DEPTH];
    m->b[0] = ACK_SYNC;
    m->b[1] = (uint8_t)r;
    m->len = 2;

    g_ackWr = wr + 1;
    return true;
}

static bool AckQ_Peek(ack_msg_t *out)
{
    uint32_t rd = g_ackRd;
    if (rd == g_ackWr) return false;
    *out = g_ackQ[rd % ACK_Q_DEPTH];
    return true;
}

static void AckQ_Pop(void)
{
    if (g_ackRd != g_ackWr) g_ackRd++;
}

/* -------------------------------
 * Timebase via PIT
 * ------------------------------- */
static volatile uint32_t g_ms = 0;

void PIT_IRQ_HANDLER(void)
{
    if (PIT_GetStatusFlags(DEMO_PIT_BASEADDR, DEMO_PIT_CHANNEL) & kPIT_TimerFlag)
    {
        PIT_ClearStatusFlags(DEMO_PIT_BASEADDR, DEMO_PIT_CHANNEL, kPIT_TimerFlag);
        g_ms += 10U;
        FI_SetNowMs(g_ms);
    }
    SDK_ISR_EXIT_BARRIER;
}

static void Pit10ms_Init(void)
{
    pit_config_t pitConfig;
    PIT_GetDefaultConfig(&pitConfig);
    PIT_Init(DEMO_PIT_BASEADDR, &pitConfig);

    /* 10 ms tick */
    PIT_SetTimerPeriod(DEMO_PIT_BASEADDR, DEMO_PIT_CHANNEL, USEC_TO_COUNT(10000U, PIT_SOURCE_CLOCK));
    PIT_EnableInterrupts(DEMO_PIT_BASEADDR, DEMO_PIT_CHANNEL, kPIT_TimerInterruptEnable);
    EnableIRQ(PIT_IRQ_ID);
    PIT_StartTimer(DEMO_PIT_BASEADDR, DEMO_PIT_CHANNEL);
}

/* -------------------------------
 * Plausibility barrier
 * ------------------------------- */
static uint8_t g_allowLabel[256];
static uint32_t g_lastLabelMs[256];
static const uint32_t g_minLabelIntervalMs = 20U; /* 50 Hz */

static void Plausibility_Init(void)
{
    memset(g_allowLabel, 0, sizeof(g_allowLabel));
    memset(g_lastLabelMs, 0, sizeof(g_lastLabelMs));

