sreemagal/AIRBUS-TRAINING/DAY10_EXERCISES/SOFTWARE_FAULT_INJECTION_ DATA_CORRUPTION_API_FAILURES/Deterministic_sfi_campaign_evkb_imxrt_1050_adk_hi_8582_uart_reference_implementation.c
    /* Allow-list example: change to your real labels. */
    g_allowLabel[0x01] = 1;
    g_allowLabel[0x02] = 1;
    g_allowLabel[0x03] = 1;
    g_allowLabel[0x04] = 1;
}

static bool Plausibility_Accept(uint8_t label)
{
    if (!g_allowLabel[label]) return false;

    uint32_t now = g_ms;
    uint32_t last = g_lastLabelMs[label];
    if ((now - last) < g_minLabelIntervalMs)
    {
        return false;
    }
    g_lastLabelMs[label] = now;
    return true;
}

/* -------------------------------
 * Simple CLI (non-blocking) on debug console
 * Commands:
 *   fi dump
 *   fi arm rx every <N> bits <M>
 *   fi arm txbusy every <N>
 *   fi arm txstall window <S> <E>
 *   fi arm label every <N>
 *   fi arm parity every <N>
 *   fi off
 * ------------------------------- */

static char g_cliLine[96];
static uint32_t g_cliLen = 0;

static void cli_print_cfg(void)
{
#if SFI_ENABLED
    PRINTF("\r\nSFI sites:\r\n");
    for (int i = 0; i < (int)FI_SITE_COUNT; i++)
    {
        fi_site_cfg_t *c = FI_SiteCfg((fi_site_t)i);
        if (!c) continue;
        PRINTF("  site %d: policy=%d hit=%lu fire=%lu every=%lu win=[%lu,%lu) bits=%u\r\n",
               i, (int)c->policy, c->hit_count, c->fire_count, c->every_n, c->window_start, c->window_end, c->bits_to_flip);
    }
#else
    PRINTF("\r\nSFI_DISABLED build.\r\n");
#endif
}

static void cli_handle_line(const char *line)
{
    /* Tokenize in-place copy */
    char buf[96];
    strncpy(buf, line, sizeof(buf) - 1U);
    buf[sizeof(buf) - 1U] = '\0';

    char *argv[10] = {0};
    int argc = 0;
    char *tok = strtok(buf, " \t\r\n");
    while (tok && argc < 10)
    {
        argv[argc++] = tok;
        tok = strtok(NULL, " \t\r\n");
    }
    if (argc == 0) return;

    if (strcmp(argv[0], "fi") != 0)
    {
        PRINTF("\r\nUnknown. Try: fi dump | fi arm ... | fi off\r\n");
        return;
    }

    if (argc >= 2 && strcmp(argv[1], "dump") == 0)
    {
        /* Dump a short snapshot of site counters; event log dump kept minimal */
        cli_print_cfg();
        return;
    }

    if (argc >= 2 && strcmp(argv[1], "off") == 0)
    {
#if SFI_ENABLED
        FI_DisableAll();
        PRINTF("\r\nSFI disabled (all sites).\r\n");
#endif
        return;
    }

    if (argc >= 3 && strcmp(argv[1], "arm") == 0)
    {
#if SFI_ENABLED
        fi_site_t site = FI_SITE_COUNT;
        if (strcmp(argv[2], "rx") == 0) site = FI_SITE_RX_CORRUPT;
        else if (strcmp(argv[2], "txbusy") == 0) site = FI_SITE_TX_API_FAIL;
        else if (strcmp(argv[2], "txstall") == 0) site = FI_SITE_TX_STALL;
        else if (strcmp(argv[2], "label") == 0) site = FI_SITE_A429_LABEL_TAMPER;
        else if (strcmp(argv[2], "parity") == 0) site = FI_SITE_A429_PARITY_TAMPER;

        if (site == FI_SITE_COUNT)
        {
            PRINTF("\r\nUnknown site. Use: rx|txbusy|txstall|label|parity\r\n");
            return;
        }

        fi_site_cfg_t *c = FI_SiteCfg(site);
        if (!c) return;

        if (argc >= 5 && strcmp(argv[3], "every") == 0)
        {
            c->policy = FI_POLICY_EVERY_N;
            c->every_n = (uint32_t)strtoul(argv[4], NULL, 0);
            if (site == FI_SITE_RX_CORRUPT && argc >= 7 && strcmp(argv[5], "bits") == 0)
            {
                c->bits_to_flip = (uint8_t)strtoul(argv[6], NULL, 0);
            }
            PRINTF("\r\nArmed site %d EVERY %lu\r\n", (int)site, c->every_n);
            return;
        }
        if (argc >= 6 && strcmp(argv[3], "window") == 0)
        {
            c->policy = FI_POLICY_WINDOW;
            c->window_start = (uint32_t)strtoul(argv[4], NULL, 0);
            c->window_end   = (uint32_t)strtoul(argv[5], NULL, 0);
            PRINTF("\r\nArmed site %d WINDOW [%lu,%lu)\r\n", (int)site, c->window_start, c->window_end);
            return;
        }

        PRINTF("\r\nUsage: fi arm <site> every <N> [bits <M>] | fi arm txstall window <S> <E>\r\n");
#else
        PRINTF("\r\nSFI_DISABLED build.\r\n");
#endif
        return;
    }

    PRINTF("\r\nUsage: fi dump | fi arm ... | fi off\r\n");
}

static void cli_poll(void)
{
    char ch;
    if (DbgConsole_TryGetchar(&ch) != kStatus_Success)
    {
        return;
    }

    if (ch == '\r' || ch == '\n')
    {
        if (g_cliLen > 0)
        {
            g_cliLine[g_cliLen] = '\0';
            cli_handle_line(g_cliLine);
            g_cliLen = 0;
        }
        return;
    }

    if (g_cliLen < (sizeof(g_cliLine) - 1U))
    {
        g_cliLine[g_cliLen++] = ch;
    }
}

/* -------------------------------
 * Main
 * ------------------------------- */

static data_uart_t g_dataUart;
static a429_uart_parser_t g_parser;

/* Counters */
static uint32_t rx_ok = 0;
static uint32_t rx_bad_chk = 0;
static uint32_t rx_bad_parity = 0;
static uint32_t rx_bad_plaus = 0;
static uint32_t rx_bad_len = 0;

static uint32_t tx_retries = 0;
static uint32_t tx_failures = 0;
static uint32_t tx_recoveries = 0;
static uint32_t tx_drops = 0;

/* TX stall monitor */
static uint32_t g_tx_last_progress_ms = 0;
static uint32_t g_tx_last_send_count = 0;
static uint32_t g_tx_last_checked_ms = 0;

static void telemetry_print_1s(void)
{
    static uint32_t last = 0;
    if ((g_ms - last) >= 1000U)
    {
        last = g_ms;
        PRINTF("\r\n[%lu ms] rx_ok=%lu bad_chk=%lu bad_parity=%lu bad_plaus=%lu bad_len=%lu | tx_retry=%lu tx_fail=%lu tx_recov=%lu tx_drop=%lu\r\n",
               g_ms, rx_ok, rx_bad_chk, rx_bad_parity, rx_bad_plaus, rx_bad_len,
               tx_retries, tx_failures, tx_recoveries, tx_drops);
    }
}

static void tx_stall_monitor_10ms(void)
{
    /* Run at ~10ms cadence; do not call LPUART APIs inside PIT ISR. */
    if ((g_ms - g_tx_last_checked_ms) < 10U) return;
    g_tx_last_checked_ms = g_ms;

    if (!g_dataUart.txOnGoing) return;

    uint32_t cnt = 0;
    if (DataUart_GetSendCount(&g_dataUart, &cnt) == kStatus_Success)
    {
        if (cnt != g_tx_last_send_count)
        {
            g_tx_last_send_count = cnt;
            g_tx_last_progress_ms = g_ms;
        }
        else
        {
            /* No progress */
            if ((g_ms - g_tx_last_progress_ms) > 100U)
            {
                /* Stall detected */
                tx_recoveries++;
                PRINTF("\r\nTX stall detected at %lu ms (send_count=%lu). Aborting and retrying.\r\n", g_ms, cnt);

                DataUart_AbortSend(&g_dataUart);

                /* Keep pending ACK in queue; next main-loop iteration will resend. */
                g_tx_last_progress_ms = g_ms;
                g_tx_last_send_count = 0;
            }
        }
    }
}

int main(void)
{
    BOARD_InitHardware();

