sreemagal/AIRBUS-TRAINING/DAY10_EXERCISES/SOFTWARE_FAULT_INJECTION_ DATA_CORRUPTION_API_FAILURES/Deterministic_sfi_campaign_evkb_imxrt_1050_adk_hi_8582_uart_reference_implementation.c
    USER_LED_INIT(LOGIC_LED_OFF);

#if SFI_ENABLED
    PRINTF("\r\n=== SFI BUILD: Data Corruption + API Failures (Deterministic) ===\r\n");
#else
    PRINTF("\r\n=== CLEAN BUILD (SFI disabled) ===\r\n");
#endif

    FI_Init(0xC0FFEE01U);
    A429_ParserInit(&g_parser);
    Plausibility_Init();

    Pit10ms_Init();

    /* Init data UART (ADK/HI-8582 link) */
    DataUart_Init(&g_dataUart, DATA_LPUART, DATA_LPUART_CLK_FREQ, DATA_LPUART_BAUDRATE);
    EnableIRQ(DATA_LPUART_IRQn);

    /* Prime RX */
    (void)DataUart_StartReceive1(&g_dataUart);

    PRINTF("\r\nCLI: fi dump | fi arm rx every <N> bits <M> | fi arm txbusy every <N> | fi arm txstall window <S> <E> | fi arm label every <N> | fi arm parity every <N> | fi off\r\n");

    uint32_t last_good_word = 0;
    bool last_good_valid = false;

    while (1)
    {
        /* --- CLI --- */
        cli_poll();

        /* --- RX pump --- */
        if (!g_dataUart.rxOnGoing && !g_dataUart.rxByteReady)
        {
            (void)DataUart_StartReceive1(&g_dataUart);
        }

        if (g_dataUart.rxByteReady)
        {
            uint8_t b = g_dataUart.rxByte;
            g_dataUart.rxByteReady = false;

#if SFI_ENABLED
            /* RX corruption injection point ("before" app ring buffer / parser) */
            {
                fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_RX_CORRUPT);
                bool fire = FI_ShouldFire(FI_SITE_RX_CORRUPT);
                if (cfg)
                {
                    FI_Log(FI_SITE_RX_CORRUPT, fire, cfg->hit_count, (uint32_t)b, (uint32_t)b);
                }
                if (fire)
                {
                    USER_LED_TOGGLE();
                    b = FI_CorruptByteDeterministic(b);
                }
            }
#endif

            uint32_t word = 0;
            a429_parse_result_t pr = A429_ParserFeed(&g_parser, b, &word);

            if (pr == A429_PARSE_BAD_LEN)
            {
                rx_bad_len++;
                (void)AckQ_Push(ACK_BAD_LEN);
            }
            else if (pr == A429_PARSE_BAD_CHK)
            {
                rx_bad_chk++;
                USER_LED_ON(); /* solid indicates error observed */
                (void)AckQ_Push(ACK_BAD_CHK);
            }
            else if (pr == A429_PARSE_WORD_OK)
            {
                /* Optional post-parse tampers */
#if SFI_ENABLED
                {
                    fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_A429_LABEL_TAMPER);
                    bool fire = FI_ShouldFire(FI_SITE_A429_LABEL_TAMPER);
                    if (cfg) FI_Log(FI_SITE_A429_LABEL_TAMPER, fire, cfg->hit_count, 0, word);
                    if (fire)
                    {
                        /* Flip MSB of label to push it out of allow-list deterministically. */
                        word ^= 0x00000080U;
                        USER_LED_TOGGLE();
                    }
                }
                {
                    fi_site_cfg_t *cfg = FI_SiteCfg(FI_SITE_A429_PARITY_TAMPER);
                    bool fire = FI_ShouldFire(FI_SITE_A429_PARITY_TAMPER);
                    if (cfg) FI_Log(FI_SITE_A429_PARITY_TAMPER, fire, cfg->hit_count, 0, word);
                    if (fire)
                    {
                        /* Flip parity bit (bit31). */
                        word ^= 0x80000000U;
                        USER_LED_TOGGLE();
                    }
                }
#endif

                /* Barrier 2: odd parity */
                if (!A429_CheckOddParity(word))
                {
                    rx_bad_parity++;
                    USER_LED_ON();
                    (void)AckQ_Push(ACK_BAD_PARITY);
                }
                else
                {
                    /* Barrier 3: plausibility */
                    uint8_t label = A429_Label(word);
                    if (!Plausibility_Accept(label))
                    {
                        rx_bad_plaus++;
                        USER_LED_ON();
                        (void)AckQ_Push(ACK_BAD_PLAUS);
                    }
                    else
                    {
                        rx_ok++;
                        last_good_word = word;
                        last_good_valid = true;
                        USER_LED_OFF();
                        (void)AckQ_Push(ACK_OK);
                    }
                }
            }
        }

        /* --- TX path (exercise API failures + stall recovery) --- */
        if (!g_dataUart.txOnGoing)
        {
            ack_msg_t m;
            if (AckQ_Peek(&m))
            {
                status_t st = DataUart_SendNonBlocking_FI(&g_dataUart, m.b, m.len);
                if (st == kStatus_Success)
                {
                    AckQ_Pop();
                    g_tx_last_progress_ms = g_ms;
                    g_tx_last_send_count = 0;
                }
                else if (st == kStatus_LPUART_TxBusy)
                {
                    /* Retry later */
                    tx_retries++;
                    g_dataUart.txOnGoing = false; /* because we did not actually start the driver */
                }
                else
                {
                    /* Unexpected TX failure; drop this ACK */
                    tx_failures++;
                    AckQ_Pop();
                }
            }
        }
        else
        {
            /* Maintain a moving 'progress' baseline even for normal transfers */
            if (g_tx_last_progress_ms == 0U) g_tx_last_progress_ms = g_ms;
        }

        /* If ACK queue overflowed, record and (optionally) tell peer */
        if ((g_ackWr - g_ackRd) >= ACK_Q_DEPTH)
        {
            if (AckQ_Push(ACK_TX_DROP) == false)
            {
                tx_drops++;
            }
        }

        /* --- Stall monitor + telemetry --- */
        tx_stall_monitor_10ms();
        telemetry_print_1s();

        /* Optional: print last-known-good word occasionally */
        if (last_good_valid)
        {
            /* keep silent by default; uncomment for debugging
             * PRINTF("Last good ARINC word: 0x%08lX\r\n", last_good_word);
             */
        }
    }
}

/******************************************************************************
 * File: ADK/HI-8582 side (IAR) — optional helper to generate UART frames
 *
 * This is NOT built in MCUXpresso. Copy the function below into your Holt
 * HI-8582 transmitter project (IAR), e.g. HOLT_PROJECT_BUILDS/ARINC429_TRANSMITTER/HI-8582_Demo/main.c
 *
 * It uses the existing USART/printf infrastructure found in the Holt project
 * (USART_Write / BOARD_USART_BASE).
 ******************************************************************************/

/*
//------------------------- ADK / HI-8582 (IAR) snippet -------------------------
#include <stdint.h>
#include <usart/usart.h>

static uint8_t chk8(uint8_t len, const uint8_t p[4])
{
    uint16_t s = (uint16_t)len;
    s = (uint16_t)(s + p[0] + p[1] + p[2] + p[3]);
    return (uint8_t)(s & 0xFFU);
}

static void UART_SendA429Frame(uint32_t word_le)
{
    uint8_t frame[7];
    frame[0] = 0xA5;
    frame[1] = 4;
    frame[2] = (uint8_t)(word_le & 0xFF);
    frame[3] = (uint8_t)((word_le >> 8) & 0xFF);
    frame[4] = (uint8_t)((word_le >> 16) & 0xFF);
    frame[5] = (uint8_t)((word_le >> 24) & 0xFF);
    frame[6] = chk8(frame[1], &frame[2]);

    for (int i = 0; i < 7; i++)
    {
        USART_Write(BOARD_USART_BASE, frame[i], 0);
    }
}

// Call UART_SendA429Frame(word) at a controlled rate (e.g., 50–200 Hz)
// to feed the EVKB receiver.
//-------------------------------------------------------------------------------
*/
